import React from 'react';

const Anchor = () => (
    <div>
        <h1>앵커 만들기</h1>
        <p>웹 문서가 너무 길 겨우 필요한 곳마다 문서 안에 이름을 붙여놓고 그 위치로 한 번에 이동하는 링크를 만들 수 있는데, 이 기능을 앵커(anchor)라고 합니다.</p>
        <ul id="menu">
            <li><a href="#content1">내용 1</a></li>
            <li><a href="#content2">내용 2</a></li>
            <li><a href="#content3">내용 3</a></li>
        </ul>
        <h2 id="content1">내용 1</h2>
        <p>웹 문서가 너무 길 겨우 필요한 곳마다 문서 안에 이름을 붙여놓고 그 위치로 한 번에 이동하는 링크를 만들 수 있는데, 이 기능을 앵커(anchor)라고 합니다.</p>
        <p>웹 문서가 너무 길 겨우 필요한 곳마다 문서 안에 이름을 붙여놓고 그 위치로 한 번에 이동하는 링크를 만들 수 있는데, 이 기능을 앵커(anchor)라고 합니다.</p>
        <p>웹 문서가 너무 길 겨우 필요한 곳마다 문서 안에 이름을 붙여놓고 그 위치로 한 번에 이동하는 링크를 만들 수 있는데, 이 기능을 앵커(anchor)라고 합니다.</p>
        <p><a href="#menu">[메뉴로]</a></p>

        <h2 id="content2">내용 2</h2>
        <p>웹 문서가 너무 길 겨우 필요한 곳마다 문서 안에 이름을 붙여놓고 그 위치로 한 번에 이동하는 링크를 만들 수 있는데, 이 기능을 앵커(anchor)라고 합니다.</p>
        <p>웹 문서가 너무 길 겨우 필요한 곳마다 문서 안에 이름을 붙여놓고 그 위치로 한 번에 이동하는 링크를 만들 수 있는데, 이 기능을 앵커(anchor)라고 합니다.</p>
        <p>웹 문서가 너무 길 겨우 필요한 곳마다 문서 안에 이름을 붙여놓고 그 위치로 한 번에 이동하는 링크를 만들 수 있는데, 이 기능을 앵커(anchor)라고 합니다.</p>
        <p><a href="#menu">[메뉴로]</a></p>

        <h2 id="content3">내용 3</h2>
        <p>웹 문서가 너무 길 겨우 필요한 곳마다 문서 안에 이름을 붙여놓고 그 위치로 한 번에 이동하는 링크를 만들 수 있는데, 이 기능을 앵커(anchor)라고 합니다.</p>
        <p>웹 문서가 너무 길 겨우 필요한 곳마다 문서 안에 이름을 붙여놓고 그 위치로 한 번에 이동하는 링크를 만들 수 있는데, 이 기능을 앵커(anchor)라고 합니다.</p>
        <p>웹 문서가 너무 길 겨우 필요한 곳마다 문서 안에 이름을 붙여놓고 그 위치로 한 번에 이동하는 링크를 만들 수 있는데, 이 기능을 앵커(anchor)라고 합니다.</p>
        <p><a href="#menu">[메뉴로]</a></p>
    </div>
);
export default Anchor